app/controllers/events_controller.rb

SELECT  "events".* FROM "events" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"
---
  def index
    @events = Event.page(params[:page]).per(5)

INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test1"], ["description", "test"], ["created_at", "2018-03-19 05:16:23.931512"], ["updated_at", "2018-03-19 05:16:23.931512"]]
---
  def create
    @event = Event.new(event_params)
    if @event.save

UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "test\r\nnew line\r\nnew line"], ["updated_at", "2018-03-19 07:12:04.823236"], ["id", 4]]
---
  def update
    if @event.update(event_params)